<script setup lang="ts"></script>

<template>
  <div class="w-100 mx-4 mt-4 mb-10 d-flex flex-column ga-4">
    <h2 class="text-h4">Тестовое задание</h2>
    <p class="text-md">
      Необходимо с помощью <b>Vuejs</b>, <b>Vuex</b>, <b>VueRouter</b>, <b>Vuetify</b> написать
      приложение. Хэдер приложения должен содержать меню из 2-х пунктов: <b>О задании</b> и
      <b>Карта</b>. В основной части приложения должно отображаться содержимое разделов.
    </p>
    <h5 class="text-h5">Раздел "О задании"</h5>
    <p class="text-md">В разделе должен быть текст этого задания, сверстанный аналогично.</p>
    <h5 class="text-h5">Раздел "Карта"</h5>
    <p class="text-md">На экране должны быть карта и список (см. пример):</p>
    <ol>
      <li>
        При клике на кнопку добавления, карта должна перейти в режим добавления маркера: в месте
        клика должен появится маркер, а в списке - запись с адресом точки.
      </li>
      <li>
        <ol>
          <li>
            Для поиска адреса можно использовать любое бесплатное API для геокодирования, например:
            https://geocode.maps.co/.
          </li>
          <li>
            В случае, если адрес не найден, необходимо вывести ошибку и не добавлять маркер в
            список.
          </li>
        </ol>
      </li>
      <li>При клике на маркер должна подсвечиваться запись в списке.</li>
      <li>При клике на запись в списке карта должна центрироваться на маркере.</li>
      <li>Маркеры должны храниться локально и не пропадать после перезагрузки страницы.</li>
      <li>В адресной строке должен отображаться id выбранного маркера.</li>
    </ol>
    <p class="text-md">
      Локальное хранение данных должно быть организовано в виде сервиса, эмулирующего бекенд.
      (Необходим класс Backend, который псевдо-асинхронно сохраняет данные в localStorage)
    </p>
    <h5 class="text-h6">Дополнительно:</h5>
    <ol>
      <li>Продумать отображение на мобильных устройствах.</li>
      <li>Предусмотреть локализацию.</li>
      <li>Необходимо с помощью <u>jest</u> написть 1 модульный тест на любой компонент.</li>
    </ol>
    <h5 class="text-h6">Напоминание:</h5>
    <p class="text-md">
      Тестовое задание призвано показать умение писать хороший модульный код, а также умение
      пользоваться указанными технологиями и не только. Этим кодом нужно гордиться.
    </p>
  </div>
</template>

<style scoped>
ol {
  margin-left: 24px;

  & ol {
    list-style-type: lower-latin;
  }
}
</style>
